#include <iostream>
#include <vector>
using namespace std;

vector<string> arms5{
    "四风原典",
    "天空之卷",
    "阿莫斯之弓",
    "风鹰剑",
    "和璞鸢",
    "狼的末路",
    "天空之傲",
    "天空之脊",
    "天空之刃",
    "天空之翼"};

vector<string> arms4{
    "弓藏",
    "祭礼弓",
    "绝弦",
    "西风猎弓",
    "昭心",
    "祭礼残章",
    "流浪乐章",
    "西风秘典",
    "西风长枪",
    "匣里灭辰",
    "雨裁",
    "祭礼大剑",
    "钟剑",
    "西风大剑",
    "匣里龙吟",
    "祭礼剑",
    "笛剑",
    "西风剑"};

vector<string> arms3{
    "弹弓",
    "神射手之誓",
    "鸦羽弓",
    "翡玉法球",
    "讨龙英杰谭",
    "魔导绪论",
    "黑缨枪",
    "以理服人",
    "沐浴龙血的剑",
    "铁影阔剑",
    "飞天御剑",
    "黎明神剑",
    "冷刃"};
    
vector<string> pro4{
    "久岐忍",
    "云堇",
    "鹿野院平藏",
    "九条裟罗",
    "五郎",
    "早柚",
    "托马",
    "烟绯",
    "罗莎莉亚",
    "辛焱",
    "迪奥娜",
    "重云",
    "诺艾尔",
    "班尼特",
    "菲谢尔",
    "凝光",
    "北斗",
    "香菱",
    "雷泽",
    "芭芭拉",
    "科莱",
    "法露珊",
    "瑶瑶"};
vector<string> pro5{
    "刻晴",
    "莫娜",
    "七七",
    "迪卢克",
    "琴",
    "提纳里"};

string uppro1 = "胡桃";
string uppro2 = "夜兰";
vector<string> uppro{"行秋", "北斗", "凝光"};
